%%确定降质图像里各个方向子带中幅值大于一定阈值系数在该子带内所占的比例
%NC1 由参考图像获得
%(1)WBCT为2层3级分解
%(2)WBCT为1层3级分解
function NC2 = rr_feature_calculation(im,NC1)


%//////////////////////////////////////////////////////////////////
% C=WBCT(double(im),'db1','9-7',[3,3]);%(1)首先进行WBCT分解,与参考端处理完全相同
                               %我们取两层分解 
 C=WBCT(double(im),[1,1,1]);  %(1)首先进行3层小波分解,与参考端处理完全相同
                                  %我们取两层分解                             
%  C=WBCT(double(im),'pkva',[3,3]);%(1)首先进行WBCT分解 %我们取两层分解                              
%/////////////////////////////////////////////////////////////////
% C=WBCT(double(im),'9-7',3);%(2)首先进行WBCT分解,与参考端处理完全相同
                               %我们取1层3级分解                                 

%////////////////////////////////////////////////////////////////
%阈值
thr=NC1(1);
%////////////////////////////////////////////////////////////////////
%//////////////////////////////////////////////////////////////////////
%(1)与参考端相同，首先计算次细节层（第二层）中个方向中系数大于阈值的比例的。
n=1;
i=2;
w=WCSF(3/32);
for j=1:3
  for k=1:2:8
      n=n+1;
      oband=C{i}{j};
      band=oband*w;
      absband=abs(band);
      NC2(n) =round(512*length(find(absband>=thr))/prod(size(absband)))/512;
   end
end
%/////////////////////////////////////////////////////////////////////////
%/////////////////////////////////////////////////////////////////////////
%(1),(2)与参考端相同，计算最细节层（第三层）中个方向中系数大于阈值的比例的。
i = 3;%(1)
% i=2;    %(2)
% n=1;    %(2)
w=WCSF(3/16);
for j=1:3
    for k=2:2:8
        n=n+1;
        oband=C{i}{j};
        band=oband*w;
        absband=abs(band);
        NC2(n) =round(512*length(find(absband>=thr))/prod(size(absband)))/512;
    end
end
i = 4;%(1)
% i=2;     %(2)
% n=1;     %(2)
w=WCSF(3/8);
for j=1:3
  for k=2:2:8
     n=n+1;
     oband=C{i}{j};
     band=oband*w;
     absband=abs(band);
     NC2(n) =round(512*length(find(absband>=thr))/prod(size(absband)))/512;%给出第1层所占比例（最外层）
  end
end
return